Aliceykr/2026G/STM32/App/Src/GSignalFlow.c
#include "GSignalFlow.h"

#include "FpgaLink.h"
#include "GMeasurementCalibration.h"
#include "SpectrumAnalyzer.h"
#include "GSerial.h"
#include "tjc_usart_hmi.h"
#include "stm32f4xx_hal.h"

#include <stdio.h>
#include <string.h>

#define G_FLOW_STATUS_POLL_MS       2U
#define G_FLOW_UART_TIMEOUT_MS      50U
#define G_FLOW_RESPONSE_LIMIT_MS    2000U
#define G_FLOW_ASCII_DEBUG_ENABLED   1U
#define G_FLOW_HMI_IDLE_REFRESH_MS  2000U
#define G_FLOW_HMI_MEASUREMENT_FIELDS 9U
#define G_FLOW_HMI_BUSY_MIN_MS        300U
#define G_FLOW_CAPTURE_TIMEOUT_MS     2000U
#define G_FLOW_WAVE_HEIGHT_DIVISOR    3U
#define G_FLOW_WAVE_VERTICAL_OFFSET   20U
#define G_FLOW_WAVE_FALLBACK_POINTS   512U
#define G_FLOW_WAVE_MAX_POINTS        1024U
#define G_FLOW_SPECTRUM_HEIGHT_DIVISOR 3U
#define G_FLOW_SPECTRUM_VERTICAL_OFFSET 42U
#define G_FLOW_SPECTRUM_FALLBACK_POINTS 512U
#define G_FLOW_SPECTRUM_MAX_POINTS    1024U
#define G_FLOW_SPECTRUM_NOISE_THRESHOLD 72U
#define G_FLOW_SPECTRUM_NEIGHBOR_THRESHOLD 48U
#define G_FLOW_SPECTRUM_MIN_HZ        10000UL
#define G_FLOW_SPECTRUM_MAX_HZ        500000UL
#define G_FLOW_BUTTON_DEBOUNCE_MS     120U

typedef enum
{
    G_FLOW_STATE_IDLE = 0,
    G_FLOW_STATE_WAIT_ANALYSIS,
    G_FLOW_STATE_WAIT_WAVEFORM,
    G_FLOW_STATE_WAIT_RESTART,
    G_FLOW_STATE_HOLD
} GFlowState;

static int16_t s_CaptureFrame[SPECTRUM_FRAME_LENGTH];
static SpectrumResult s_Result;
static GMeasurementResult s_Measurement;
static GMeasurementWaveform s_Waveform;
static GFlowState s_State;
static uint32_t s_NextActionTick;
static uint32_t s_ReportSequence;
static uint32_t s_ActiveSequence;
static uint32_t s_CycleStartTick;
static uint32_t s_AnalysisElapsedMs;
static uint32_t s_FpgaId;
static uint32_t s_NextIdleHmiTextTick;
static uint8_t s_FpgaOnline;
static uint8_t s_SelectedWaveformCycles;
static uint8_t s_ActiveWaveformCycles;
static uint8_t s_CycleChangePending;
static uint8_t s_WaveFrameValid;
static uint8_t s_MeasurementEnabled;
static uint8_t s_HmiMeasurementField;
static uint8_t s_HmiMeasurementPending;
static uint8_t s_HmiReadyPending;
static uint32_t s_HmiBusyUntilTick;
static uint32_t s_LastStartEventTick;
static uint32_t s_LastCycleEventTick;
static uint16_t s_WaveDisplayPoints;
static uint8_t s_WaveDisplay[G_FLOW_WAVE_MAX_POINTS];
static uint16_t s_SpectrumDisplayPoints;
static uint8_t s_SpectrumDisplay[G_FLOW_SPECTRUM_MAX_POINTS];
static uint8_t s_SpectrumFiltered[G_FLOW_SPECTRUM_MAX_POINTS];
static uint8_t s_SpectrumScreenInitialized;

static void GSignalFlow_SendText(const char *text);
static void GSignalFlow_SendStartup(void);
static void GSignalFlow_SendError(const char *stage);
static void GSignalFlow_SendNoSignal(void);
static void GSignalFlow_SendResult(void);
static uint8_t GSignalFlow_SendMeasurement(void);
static uint32_t GSignalFlow_RoundPositive(float value);
static void GSignalFlow_FormatFixed2(float value,
                                     char *buffer,
                                     size_t buffer_size);
static void GSignalFlow_StartOrRetry(uint32_t now);
static void GSignalFlow_FinishCycle(uint32_t now);
static void GSignalFlow_AbortCycle(const char *stage,
                                  const char *hmi_status);
static void GSignalFlow_HandleCommand(void);
static void GSignalFlow_UpdateHmiPlaceholders(void);
static void GSignalFlow_QueueHmiMeasurement(void);
static void GSignalFlow_ServiceHmiMeasurement(void);
static void GSignalFlow_UpdateHmiMeasurementField(uint8_t field);
static void GSignalFlow_UpdateHmiNoSignal(void);
static uint8_t GSignalFlow_UpdateHmiSpectrum(uint8_t signal_valid);
static uint8_t GSignalFlow_IsKnownSpectrumPoint(uint16_t point,
                                                uint16_t point_count);
static void GSignalFlow_UpdateHmiWaveform(void);
static uint8_t GSignalFlow_BuildAndDisplayWaveform(uint8_t cycles);

void GSignalFlow_Init(void)
{
    memset(s_CaptureFrame, 0, sizeof(s_CaptureFrame));
    memset(&s_Result, 0, sizeof(s_Result));
    memset(&s_Measurement, 0, sizeof(s_Measurement));
    memset(&s_Waveform, 0, sizeof(s_Waveform));
    memset(s_WaveDisplay, 0, sizeof(s_WaveDisplay));
    memset(s_SpectrumDisplay, 0, sizeof(s_SpectrumDisplay));
    memset(s_SpectrumFiltered, 0, sizeof(s_SpectrumFiltered));
    s_State = G_FLOW_STATE_IDLE;
    s_NextActionTick = HAL_GetTick();
    s_ReportSequence = 0UL;
    s_ActiveSequence = 0UL;
    s_CycleStartTick = HAL_GetTick();
    s_AnalysisElapsedMs = 0UL;
    s_FpgaId = 0UL;
    s_NextIdleHmiTextTick = HAL_GetTick();
    s_SelectedWaveformCycles = 1U;
    s_ActiveWaveformCycles = 1U;
    s_CycleChangePending = 0U;
    s_WaveFrameValid = 0U;
    s_MeasurementEnabled = 0U;
    s_HmiMeasurementField = 0U;
    s_HmiMeasurementPending = 0U;
    s_HmiReadyPending = 0U;
    s_HmiBusyUntilTick = 0UL;
    s_LastStartEventTick = HAL_GetTick() - G_FLOW_BUTTON_DEBOUNCE_MS;
    s_LastCycleEventTick = HAL_GetTick() - G_FLOW_BUTTON_DEBOUNCE_MS;
    s_WaveDisplayPoints = 0U;
    s_SpectrumDisplayPoints = 0U;
    s_SpectrumScreenInitialized = 0U;

    TjcHmi_Init();

    FpgaLink_Init();
    s_FpgaOnline = Fpga_ReadId(&s_FpgaId);
    GSignalFlow_SendStartup();
}

void GSignalFlow_Process(void)
{
    uint32_t now = HAL_GetTick();

    GSignalFlow_HandleCommand();
    GSignalFlow_ServiceHmiMeasurement();

    if (s_State == G_FLOW_STATE_IDLE)
    {
        /*
         * 屏幕上电通常慢于MCU。开始测量前每2秒重发一次XXX占位文字，
         * 避免第一次命令发送过早后仍显示工程里的默认newtxt。
         */
        if ((int32_t)(now - s_NextIdleHmiTextTick) >= 0)
        {
            /* 兼容上一版可能遗留的ref_stop状态，确保屏幕继续刷新。 */
            tjc_send_string("ref_star");
            GSignalFlow_UpdateHmiPlaceholders();
            TjcHmi_SetComputeBusy(0U);
            if (s_SpectrumScreenInitialized == 0U)
            {
                (void)GSignalFlow_UpdateHmiSpectrum(0U);
            }
            s_NextIdleHmiTextTick = now + G_FLOW_HMI_IDLE_REFRESH_MS;
        }
        return;
    }

    /* 单次测量完成后保持本轮结果，直到再次按下“开始测量”。 */
    if (s_State == G_FLOW_STATE_HOLD)
    {
        return;
    }

    if ((int32_t)(now - s_NextActionTick) < 0)
    {
        return;
    }

    if (s_State == G_FLOW_STATE_WAIT_RESTART)
    {
        GSignalFlow_StartOrRetry(now);
        return;
    }

    {
        uint32_t status = 0UL;

