Aliceykr/2026G/STM32/App/Src/GSignalFlow.c
    GSignalFlow_SendText(buffer);
    return 1U;
}

static void GSignalFlow_QueueHmiMeasurement(void)
{
    /* 三个主要参数先立即显示，确保后续波形采集不会拖住Urms。 */
    GSignalFlow_UpdateHmiMeasurementField(0U);
    GSignalFlow_UpdateHmiMeasurementField(1U);
    GSignalFlow_UpdateHmiMeasurementField(2U);
    s_HmiMeasurementField = 3U;
    s_HmiMeasurementPending = 1U;
}

/* 每次主循环最多更新一个文本控件，避免参数集中成批发送。 */
static void GSignalFlow_ServiceHmiMeasurement(void)
{
    if (s_HmiMeasurementPending != 0U)
    {
        GSignalFlow_UpdateHmiMeasurementField(s_HmiMeasurementField);
        s_HmiMeasurementField++;

        if (s_HmiMeasurementField >= G_FLOW_HMI_MEASUREMENT_FIELDS)
        {
            s_HmiMeasurementPending = 0U;
        }
        return;
    }

    if ((s_HmiReadyPending != 0U) &&
        (s_State == G_FLOW_STATE_HOLD) &&
        ((int32_t)(HAL_GetTick() - s_HmiBusyUntilTick) >= 0))
    {
        TjcHmi_SetComputeBusy(0U);
        s_HmiReadyPending = 0U;
    }
}

static void GSignalFlow_UpdateHmiMeasurementField(uint8_t field)
{
    char text[64];
    char value_text[24];
    uint8_t component;
    const char *object_name;

    if (field == 0U)
    {
        GSignalFlow_FormatFixed2(s_Measurement.fundamental_hz,
                                 value_text,
                                 sizeof(value_text));
        (void)snprintf(text,
                       sizeof(text),
                       "f0=%s Hz",
                       value_text);
        tjc_send_txt("g0", "txt", text);
        return;
    }
    if (field == 1U)
    {
        GSignalFlow_FormatFixed2(s_Measurement.upp_mv,
                                 value_text,
                                 sizeof(value_text));
        (void)snprintf(text,
                       sizeof(text),
                       "Vpp=%s mV",
                       value_text);
        tjc_send_txt("g1", "txt", text);
        return;
    }
    if (field == 2U)
    {
        GSignalFlow_FormatFixed2(s_Measurement.urms_mv,
                                 value_text,
                                 sizeof(value_text));
        (void)snprintf(text,
                       sizeof(text),
                       "Urms=%s mV",
                       value_text);
        tjc_send_txt("g2", "txt", text);
        return;
    }

    if (field <= 5U)
    {
        component = (uint8_t)(field - 3U);
        object_name = (field == 3U) ? "g3" :
                      ((field == 4U) ? "g4" : "g5");

        if (component < s_Measurement.component_count)
        {
            const GMeasurementComponent *item =
                &s_Measurement.components[component];
            char frequency_text[24];
            char amplitude_text[24];

            GSignalFlow_FormatFixed2(item->frequency_hz,
                                     frequency_text,
                                     sizeof(frequency_text));
            GSignalFlow_FormatFixed2(item->amplitude_mv,
                                     amplitude_text,
                                     sizeof(amplitude_text));
            (void)snprintf(text,
                           sizeof(text),
                           "C%u=H%u,%s Hz,%s mV",
                           (unsigned int)(component + 1U),
                           (unsigned int)item->harmonic,
                           frequency_text,
                           amplitude_text);
        }
        else
        {
            (void)snprintf(text,
                           sizeof(text),
                           "C%u=XXX",
                           (unsigned int)(component + 1U));
        }
        tjc_send_txt(object_name, "txt", text);
        return;
    }

    if (field < G_FLOW_HMI_MEASUREMENT_FIELDS)
    {
        uint8_t harmonic = (uint8_t)(field - 5U);
        const GMeasurementComponent *matched = NULL;
        char harmonic_object[3] =
            {'g', (char)('5' + harmonic), '\0'};

        for (component = 0U;
             component < s_Measurement.component_count;
             component++)
        {
            if (s_Measurement.components[component].harmonic == harmonic)
            {
                matched = &s_Measurement.components[component];
                break;
            }
        }

        if (matched != NULL)
        {
            GSignalFlow_FormatFixed2(matched->amplitude_mv,
                                     value_text,
                                     sizeof(value_text));
            (void)snprintf(text,
                           sizeof(text),
                           "H%u=%s mV",
                           (unsigned int)harmonic,
                           value_text);
        }
        else
        {
            (void)snprintf(text,
                           sizeof(text),
                           "H%u=XXX mV",
                           (unsigned int)harmonic);
        }
        tjc_send_txt(harmonic_object, "txt", text);
    }
}

static void GSignalFlow_UpdateHmiPlaceholders(void)
{
    uint8_t field;
    uint8_t harmonic;

    tjc_send_txt("g0", "txt", "f0=XXX Hz");
    tjc_send_txt("g1", "txt", "Vpp=XXX mV");
    tjc_send_txt("g2", "txt", "Urms=XXX mV");
    for (field = 3U; field <= 5U; field++)
    {
        char object_name[3] = {'g', (char)('0' + field), '\0'};
        char text[12];

        (void)snprintf(text,
                       sizeof(text),
                       "C%u=XXX",
                       (unsigned int)(field - 2U));
        tjc_send_txt(object_name, "txt", text);
    }
    for (harmonic = 1U; harmonic <= 3U; harmonic++)
    {
        char object_name[3] =
            {'g', (char)('5' + harmonic), '\0'};
        char text[20];

        (void)snprintf(text,
                       sizeof(text),
                       "H%u=XXX mV",
                       (unsigned int)harmonic);
        tjc_send_txt(object_name, "txt", text);
    }
}

static void GSignalFlow_UpdateHmiNoSignal(void)
{
    s_HmiMeasurementPending = 0U;
    GSignalFlow_UpdateHmiPlaceholders();
    (void)GSignalFlow_UpdateHmiSpectrum(0U);
}

static uint8_t GSignalFlow_UpdateHmiSpectrum(uint8_t signal_valid)
{
    uint16_t point;
    uint8_t component;
    uint16_t display_points = s_SpectrumDisplayPoints;
    uint8_t width_ready = 1U;

