Aliceykr/2026G/STM32/App/Src/GSignalFlow.c
    if (display_points == 0U)
    {
        if (TjcHmi_GetComponentWidth("s1", &display_points) != 0U)
        {
            s_SpectrumDisplayPoints = display_points;
        }
        else
        {
            display_points = G_FLOW_SPECTRUM_FALLBACK_POINTS;
            width_ready = 0U;
        }
    }

    if (display_points > G_FLOW_SPECTRUM_MAX_POINTS)
    {
        display_points = G_FLOW_SPECTRUM_MAX_POINTS;
    }

    if ((signal_valid == 0U) ||
        (SpectrumAnalyzer_BuildDisplay(s_SpectrumDisplay,
                                       display_points) == 0U))
    {
        memset(s_SpectrumDisplay,
               G_FLOW_SPECTRUM_VERTICAL_OFFSET,
               display_points);
    }
    else
    {
        /*
         * BuildDisplay按10kHz->500kHz的FFT bin递增顺序输出。
         * 峰值高度压缩为原来的1/3，基线为上一版半高值的1/3。
         * 最大值池化会放大随机单点噪声，因此压低底噪并剔除
         * 两侧都没有能量支撑的孤立毛刺；已识别峰值保持原高度。
         */
        for (point = 0U; point < display_points; point++)
        {
            uint16_t left = (point > 0U)
                ? s_SpectrumDisplay[point - 1U] : 0U;
            uint16_t center = s_SpectrumDisplay[point];
            uint16_t right = (point + 1U < display_points)
                ? s_SpectrumDisplay[point + 1U] : 0U;
            uint16_t filtered = 0U;

            if (center >= G_FLOW_SPECTRUM_NOISE_THRESHOLD)
            {
                if (GSignalFlow_IsKnownSpectrumPoint(
                        point, display_points) != 0U)
                {
                    filtered = center;
                }
                else if ((left >= G_FLOW_SPECTRUM_NEIGHBOR_THRESHOLD) ||
                         (right >= G_FLOW_SPECTRUM_NEIGHBOR_THRESHOLD))
                {
                    filtered = (uint16_t)(
                        (left + 2U * center + right + 2U) / 4U);
                    if (filtered < G_FLOW_SPECTRUM_NOISE_THRESHOLD)
                    {
                        filtered = 0U;
                    }
                }
            }

            s_SpectrumFiltered[point] = (uint8_t)filtered;
        }

        for (point = 0U; point < display_points; point++)
        {
            s_SpectrumDisplay[point] = (uint8_t)(
                s_SpectrumFiltered[point] /
                G_FLOW_SPECTRUM_HEIGHT_DIVISOR +
                G_FLOW_SPECTRUM_VERTICAL_OFFSET);
        }
    }

    tjc_clear_wave("s1.id", 0);
    tjc_send_wave("s1.id",
                  0,
                  s_SpectrumDisplay,
                  display_points);

    if ((signal_valid != 0U) &&
        (s_Result.valid != 0U))
    {
        for (component = 0U;
             component < s_Result.component_count;
             component++)
        {
            const SpectrumComponent *peak =
                &s_Result.components[component];
            uint32_t frequency_hundredths_hz =
                GSignalFlow_RoundPositive(
                    peak->frequency_hz * 100.0f);

            if (frequency_hundredths_hz >= 1000000UL)
            {
                (void)TjcHmi_DrawSpectrumPeakLabel(
                    frequency_hundredths_hz,
                    peak->harmonic,
                    component);
            }
        }
    }
    if (width_ready != 0U)
    {
        s_SpectrumScreenInitialized = 1U;
        return 1U;
    }

    s_SpectrumScreenInitialized = 0U;
    return 0U;
}

static uint8_t GSignalFlow_IsKnownSpectrumPoint(uint16_t point,
                                                uint16_t point_count)
{
    uint8_t component;

    if ((point_count < 2U) || (s_Result.valid == 0U))
    {
        return 0U;
    }

    for (component = 0U;
         component < s_Result.component_count;
         component++)
    {
        uint32_t frequency_hz = GSignalFlow_RoundPositive(
            s_Result.components[component].frequency_hz);

        if ((frequency_hz >= G_FLOW_SPECTRUM_MIN_HZ) &&
            (frequency_hz <= G_FLOW_SPECTRUM_MAX_HZ))
        {
            uint32_t expected =
                ((frequency_hz - G_FLOW_SPECTRUM_MIN_HZ) *
                 (uint32_t)(point_count - 1U) +
                 (G_FLOW_SPECTRUM_MAX_HZ -
                  G_FLOW_SPECTRUM_MIN_HZ) / 2UL) /
                (G_FLOW_SPECTRUM_MAX_HZ -
                 G_FLOW_SPECTRUM_MIN_HZ);
            uint32_t distance = (point > expected)
                ? (uint32_t)point - expected
                : expected - (uint32_t)point;

            if (distance <= 2UL)
            {
                return 1U;
            }
        }
    }

    /* 保留分析器确认的最强非谐波峰，但不绘制Hn标签。 */
    if (s_Result.spur_valid != 0U)
    {
        uint32_t frequency_hz = GSignalFlow_RoundPositive(
            s_Result.spur_frequency_hz);

        if ((frequency_hz >= G_FLOW_SPECTRUM_MIN_HZ) &&
            (frequency_hz <= G_FLOW_SPECTRUM_MAX_HZ))
        {
            uint32_t expected =
                ((frequency_hz - G_FLOW_SPECTRUM_MIN_HZ) *
                 (uint32_t)(point_count - 1U) +
                 (G_FLOW_SPECTRUM_MAX_HZ -
                  G_FLOW_SPECTRUM_MIN_HZ) / 2UL) /
                (G_FLOW_SPECTRUM_MAX_HZ -
                 G_FLOW_SPECTRUM_MIN_HZ);
            uint32_t distance = (point > expected)
                ? (uint32_t)point - expected
                : expected - (uint32_t)point;

            if (distance <= 2UL)
            {
                return 1U;
            }
        }
    }

    return 0U;
}

static uint8_t GSignalFlow_BuildAndDisplayWaveform(uint8_t cycles)
{
    if (GMeasurement_BuildWaveform(
            s_CaptureFrame,
            SPECTRUM_FRAME_LENGTH,
            G_MEASUREMENT_WAVEFORM_SAMPLE_RATE_HZ,
            s_Result.fundamental_hz,
            cycles,
            &s_Waveform) == 0U)
    {
        return 0U;
    }

    GSignalFlow_UpdateHmiWaveform();
    return 1U;
}

static void GSignalFlow_UpdateHmiWaveform(void)
{
    int32_t minimum;
    int32_t range;
    uint16_t point;
    uint16_t display_points = s_WaveDisplayPoints;

    if ((s_Waveform.valid == 0U) ||
        (s_Waveform.point_count != G_MEASUREMENT_WAVEFORM_POINTS))
    {
        return;
    }

